erpdev.СХК_Расширение/src/Documents/ЗаказНаСборку/ЗаказНаСборку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b1dfe632-f392-4509-be4f-e18b73ce726b">
  <name>ЗаказНаСборку</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="67addbb6-c8a9-4f19-82d8-7fad629251a7">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aee38b32-1a5b-4f61-8dc2-99c016377ffd">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4defa09d-4411-4a4b-a9d8-d8dca5e76f2c">
    <name>НазначениеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СХК_СерииНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="c9a79b40-dfb8-4d19-8f24-19479b5077a6">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7c25e0db-85b8-43c8-bd2c-9585c71f7abb">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="613dd09b-8d9f-4696-bb8c-4c549f7964f2">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="94e57fe9-4322-4cce-ab04-50ad6ba1b970">
    <name>ВариантОбеспечения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="007d75ac-7be9-4628-9fd7-ef8aa2f58506">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3ca702ef-460f-45a1-8246-24e8fed96f63">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5bd881f5-ac5d-4b7b-9636-48e3fd14585b">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d36e55d0-c896-4beb-b33b-b92cef686a32">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="44a308b8-55d3-4b73-b2e9-887f1da287eb">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b16fd72e-431d-4747-bbd8-6d6c0b30c93c">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ee9922c5-f6bd-40b2-8afc-e6beeb766d03">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7873695c-e1c9-4bc1-9aed-ab8d33fc60a6">
    <name>ВариантКомплектации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4ab5257a-9c1c-44f3-b0c7-281f6a83d4a7">
    <name>КоличествоУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6c6cb23a-9c6a-4211-a772-ac9095e991f7">
    <name>Обособленно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ab181519-cc9a-4b49-97ac-236db9d513ba">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6c61f4a8-d130-48ad-9427-98115eec53f5">
    <name>СтатусУказанияСерий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="010c97c2-fba0-4184-8c33-8959792d7cc3">
    <name>КоличествоОтменено</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7a51fce6-be1a-4b36-9188-31f7b4a10b30">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7115a331-3286-43af-b3ff-dc63b67d9660">
    <name>ДлительностьСборкиРазборки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="429809b1-a26a-4bdd-aa88-cd76318044d8">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="53d83f8b-f88d-4744-9cf0-b4b671905a41">
    <name>НачалоСборкиРазборки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="93945c86-4eac-42c4-8953-c8cc1bfb2c12">
    <name>ОкончаниеСборкиРазборки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6ef50f49-36a2-4ee2-9c0e-ed8fa286a765">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b3a50092-f626-41bb-84a2-ed4397d6865f">
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="43f05447-cd8f-4549-b5a5-6196ebfbabe0">
    <name>СборкаПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="f291358e-4556-4e23-8728-3eb7f8587728">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c00c1f76-cd64-4f67-a639-14bea5cfa177">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f3105081-e6f3-4558-9808-cce8e494cf84">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1e93e976-c5e8-4c57-9fc0-e6e3f7dc5d73">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9a8eaf86-52f2-4338-b434-30faba66ce69">
      <name>УказыватьСерии</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1321cce4-0c0c-4651-9d6b-ab17eaf2d93c">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f33ded88-1f22-460b-8350-3b16c4db6e87">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b9fb5f62-f3a1-4b0d-a4d2-446fa832a0fa">
      <name>ВариантОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="633fdcc4-2036-4aae-bd60-14f614c41ff4">
      <name>Обособленно</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7f69bdca-abb9-4385-9551-f921eda1f1db">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5f27c34c-94be-4622-a1b7-b4ad53823203">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4893359f-9d16-4f03-927b-d4030c8f66f5">
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/InformationRegisters/СХК_ЗаданиеНаПечатьЭтикеток/СХК_ЗаданиеНаПечатьЭтикеток.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СХК_ЗаданиеНаПечатьЭтикеток</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>НомерСмены</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Вложение</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипЭтикетки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КолЭтикеток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПечати</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаказНаПроизводств</name>
    <type>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

erpdev.СХК_Расширение/src/Catalogs/СерииНоменклатуры/СерииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СерииНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ГоденДо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cb25b6bc-7f7a-447b-8658-e8893ac87128">
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СХК_Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="43c7d80b-bd8e-4151-b0e1-084444292845">
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СХК_СрокГодности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СХК_Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="448beea5-fe0e-4558-b386-88fdde891a35">
    <name>ПроизводительВЕТИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="811ed59d-1e61-4b9f-b4fb-3b5dc1e65b8c">
    <name>RFIDUser</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dbf11029-162c-49c8-b54b-767bda8ca180">
    <name>СерияНоменклатурыДляЦенообразования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="80a89a7f-1fed-4811-b40c-3a5ab50662a9">
    <name>RFIDTID</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e0c1efe6-bb2e-4ed3-80a8-cab3c7e1b456">
    <name>RFIDEPC</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6dd6eb6e-b1b8-4da9-9b97-35f41594d1d6">
    <name>EPCGTIN</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="50ccfd5f-e7cd-4e00-a6ee-2b31c3198df5">
    <name>RFIDМеткаНеЧитаемая</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="28ebda52-1b95-4474-a953-08ea8d771161">
    <name>НомерКиЗГИСМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b41bc339-8059-4e1b-a18e-9b2d19e4c2e1">
    <name>ПроизводительЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0031dd3e-8675-47e2-ae98-c7e7a9b2060a">
    <name>ИдентификаторПартииВЕТИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f266e93e-196b-4c32-867c-1eb7dcc148b4">
    <name>Справка2ЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="888c0446-d41f-43e2-9d71-c2abeb77ef11">
    <name>ЗаписьСкладскогоЖурналаВЕТИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ff2d5643-26e8-40ec-b266-8fb17cd78983">
    <name>МаксимальнаяРозничнаяЦенаМОТП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

erpdev.СХК_Расширение/src/Documents/ЗаказНаСборку/Forms/ФормаДокумента/Module.bsl
&НаСервере
&Вместо("ХозяйственнаяОперацияПриИзмененииСервер")
Процедура Расш1_ХозяйственнаяОперацияПриИзмененииСервер()
		ЭтоСборкаТоваров = Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров;
	ДоступныеОстаткиПараметрыВстраивания = Неопределено;
	ПараметрыВстраивания = Документы.ЗаказНаСборку.ДоступныеОстаткиПараметрыВстраивания(Объект);
	ОбеспечениеВДокументахСервер.ДоступныеОстаткиПриСозданииНаСервере(ЭтотОбъект, ПараметрыВстраивания);
	
	УстановитьСвойстваЭлементовФормыХозяйственнаяОперация();
	Объект.Назначение = Неопределено;
	Объект.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ПустаяСсылка();
	НаправлениеДеятельностиПриИзмененииСервер();
	
	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.ЗаказНаСборку));
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий.ТЧ);
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий.Шапка);
	НастроитьЭлементыСерий();
	
	Если ЭтоСборкаТоваров Тогда
		
		СтруктураДействий = Новый Структура();
		ДобавитьДействияОбеспеченияНаСервере(СтруктураДействий, "ВариантОбеспечения");
		КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
		СтрокиТаблицы = Объект.Товары.НайтиСтроки(
			Новый Структура("ВариантОбеспечения", Перечисления.ВариантыОбеспечения.ПустаяСсылка()));
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
			СтрокиТаблицы,
			СтруктураДействий,
			Объект.Товары,
			КэшированныеЗначения);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Расш1_ЗаданиеЭтикеткиПосле(Команда)
	С = ПроверитьСтроку();
	Если С = Ложь Тогда
		Предупреждение("Не заполнена номенклатура или серия"); 
	Иначе
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Номенклатура",Объект.Номенклатура);
		ПараметрыФормы.Вставить("Серия",Объект.СХК_СерииНоменклатуры);
		ПараметрыФормы.Вставить("Ссылка",С);
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормы,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
		ОткрытьФорму("РегистрСведений.СХК_ЗаданиеНаПечатьЭтикеток.Форма.ФормаЗаписи", _Параметры,ЭтаФорма, , , , ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверитьСтроку()
	Если Объект.Номенклатура.Пустая() = Истина ИЛИ Объект.СХК_СерииНоменклатуры.Пустая() Тогда
		Возврат Ложь;
	Иначе
		Возврат Объект.Ссылка; 
	КонецЕсли;
КонецФункции 



&НаКлиенте
Процедура ОбработатьЗакрытиеФормыВыборСерииИзСписка(Значение, ДопПараметры) Экспорт  
  
	Если ЗначениеЗаполнено(Значение) Тогда                  
		Объект.СХК_СерииНоменклатуры = ПолучитьСериюПоНомеру(Значение.Номер);		
	КонецЕсли;
	
 	ЭтаФорма.ОбновитьОтображениеДанных();

КонецПроцедуры     

&НаСервере
 Функция  ПолучитьСериюПоНомеру(Номер) 
	 
	СсылкаСерия = Справочники.СерииНоменклатуры.ПустаяСсылка();
	 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СерииНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	               |ГДЕ
	               |	СерииНоменклатуры.Номер = &Номер
	               |	И СерииНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры" ;
	Запрос.УстановитьПараметр("Номер",Номер);
	Запрос.УстановитьПараметр("ВидНоменклатуры",Объект.Номенклатура.ВидНоменклатуры);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда 
		СсылкаСерия =  Рез.Ссылка;
	КонецЕсли;
	
 	Возврат  СсылкаСерия;
	
КонецФункции

&НаКлиенте
Процедура Расш1_СХК_СерииНоменклатурыНачалоВыбораПосле(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Номенклатура = ПолучитьНоменклатуру();	
	ВидНоменклатуры = ПолучитьВидНоменклатуры(); 
	
	ЭлементыОтбора = Новый Структура("ВидНоменклатуры,Номенклатура", ВидНоменклатуры,Номенклатура );
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыВыборСерииИзСписка", ЭтаФорма);
	
	ОткрытьФорму("Обработка.СХК_СоздатьСерии.Форма.ФормаСписка", ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры  

&НаСервере
Функция ПолучитьНоменклатуру()
	Возврат Объект.Номенклатура;
КонецФункции 

&НаСервере
Функция ПолучитьВидНоменклатуры()
	Возврат Объект.Номенклатура.ВидНоменклатуры;
КонецФункции
